Revit 2027 API
View3D.ToggleToIsometric Method
 Toggles this view to isometric.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ToggleToIsometric()
Public Sub ToggleToIsometric
public:
void ToggleToIsometric()
member ToggleToIsometric : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This view cannot be toggled.
Remarks
 This view can only be toggled to isometric if no view specific elements are contained.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace